{
    "id": "iron-ore-desulfurization-2025",
    "title": "Research and Industrial Practice of Key Technologies for Iron Ore Desulfurization",
    "slug": "iron-ore-desulfurization-research",
    "date": "2025-06-10",
    "author": "Zexin Mining Technical Team",
    "category": "technical",
    "summary": "This article systematically reviews iron ore desulfurization technologies, analyzes sulfur-bearing iron ore characteristics and process bottlenecks, introduces mainstream desulfurization processes and technological breakthroughs, and discusses equipment upgrades and industrial practice benefits to provide reference for mineral processing optimization.",
    "image": "/images/news/iron-desulfurization.jpg",
    "content": "<p>Iron ore resources, as the basic raw material for the steel industry, have sulfur content that directly affects smelting efficiency and steel quality. China's iron ore resources are complex, with approximately 40% of deposits containing sulfur-bearing minerals such as pyrite and pyrrhotite, resulting in iron concentrate sulfur content generally exceeding standards (0.3%-2.5%). This not only increases the desulfurization burden of blast furnaces but also easily causes hot brittleness in steel products.</p><h3>Characteristics of Sulfur-Bearing Iron Ore and Desulfurization Challenges</h3><p>Iron ore desulfurization faces multiple technical challenges, mainly stemming from the complex properties of sulfur-bearing minerals.</p><strong>1. Sulfur Occurrence States and Impacts</strong><p>Sulfur in iron ore mainly exists in various mineral forms:</p><p>- <strong>Pyrite (FeS₂)</strong>: Cubic crystal structure with good floatability but easily over-ground, generating Fe²⁺ ions during grinding that activate gangue minerals</p><p>- <strong>Pyrrhotite (Fe₁₋ₓS)</strong>: Exists in monoclinic/hexagonal crystal forms; the hexagonal type has weak magnetism (magnetic susceptibility ＜25×10⁻⁶m³/kg) and poor floatability, easily entering magnetic concentrate</p><p>- <strong>Complex sulfides</strong>: Such as chalcopyrite (CuFeS₂), requiring consideration of both sulfur removal and valuable metal recovery</p><strong>2. Process Bottlenecks</strong><p>Three major challenges exist in the mineral processing desulfurization process:</p><p>- <strong>Fine dissemination size</strong>: Pyrrhotite is often encapsulated in magnetite at 5-20μm, requiring grinding to 90% passing -0.045mm for liberation</p><p>- <strong>Pulp interference</strong>: Fe²⁺ produced by pyrrhotite oxidation consumes activating agents (such as CuSO₄), increasing flotation reagent consumption by 30%-50%</p><p>- <strong>Poor separation selectivity</strong>: Pyrrhotite and magnetite have overlapping densities (4.3-4.8g/cm³), resulting in gravity separation efficiency below 50%</p><h3>Mainstream Desulfurization Processes and Technological Breakthroughs</h3><p>Various efficient desulfurization processes have been developed for different types of sulfur-bearing iron ores.</p><strong>1. Stage Grinding—Stage Separation Process</strong><p>This process is particularly suitable for ores with significant differences in sulfide mineral dissemination size:</p><p>- <strong>Coarse grinding stage</strong>: Grinding to 65% passing -0.074mm, weak magnetic separation (magnetic field strength 160mT) to reject 40% tailings while simultaneously recovering coarse sulfur particles</p><p>- <strong>Regrinding stage</strong>: Magnetic products ground to 90% passing -0.045mm, using reverse flotation to remove fine-grained pyrrhotite</p><p>An iron mine in Anhui Province adopted this process, increasing iron concentrate grade to 66.97%, reducing sulfur content to 0.21%, while maintaining a recovery rate of 80.3%.</p><strong>2. Magnetic Separation—Flotation Combined Process</strong><p>This process developed a specialized reagent system for difficult-to-float pyrrhotite:</p><p>- <strong>Activator optimization</strong>: Using dilute sulfuric acid (10% concentration) + JL-02 compound activator to break the oxidation film on pyrrhotite surface, increasing its contact angle from 35° to 78°</p><p>- <strong>Collector innovation</strong>: Butyl xanthate + Q-319 combination (ratio 2:1), increasing adsorption on hexagonal pyrrhotite to 1.2mg/m²</p><p>After a concentrator in Inner Mongolia applied this process, iron concentrate sulfur content decreased from 0.82% to 0.26%, sulfur recovery rate increased to 88.69%, and reagent cost per ton of ore decreased by 4.3 yuan.</p><strong>3. Roasting—Magnetic Separation Process</strong><p>Low-temperature efficient heat treatment technology was developed for difficult-to-process iron ores:</p><p>- <strong>Technical principle</strong>: In a weakly reducing atmosphere (CO concentration 15%-18%), pyrrhotite transforms into strongly magnetic Fe₃O₄, increasing magnetic separation efficiency to 92%</p><p>- <strong>Energy-saving breakthrough</strong>: Suspension roasting furnace temperature reduced to 620°C (traditional vertical furnace >850°C), reducing fuel consumption by 35%; equipped with waste heat boiler to recover flue gas heat, achieving 22% steam power generation efficiency</p><h3>Key Equipment and Operational Practices</h3><p>Equipment innovation has continuously improved the efficiency of desulfurization processes.</p><strong>1. Flotation Equipment Upgrades</strong><p>New flotation equipment has been specially optimized for sulfur-bearing iron ore characteristics:</p><p>- <strong>Aeration control system</strong>: Dynamic adjustment of aeration based on online XRF analyzer (1.2m³/min·m² for low-grade ore <1.5g/t)</p><p>- <strong>Shallow trough flotation machine</strong>: Depth-to-width ratio of 0.7, paired with umbrella-shaped impellers, reducing power consumption by 18%</p><strong>2. Gravity Separation Pre-rejection Equipment</strong><p>Efficient gravity separation equipment achieves frontend waste rejection:</p><p>- <strong>Jig</strong>: Processing 30-50mm coarse particles with rejection rates >40% (using Panxi vanadium-titanium magnetite as an example)</p><p>- <strong>Spiral chute</strong>: DL2000 model with processing capacity of 40t/h, achieving highest recovery of -2mm hematite at a 45° inclination angle</p><strong>3. Flue Gas Desulfurization Equipment Innovation</strong><p>Gas processing equipment supporting roasting processes has also achieved breakthroughs:</p><p>- <strong>Immersion reactor</strong>: Partition discs control bubble diameter to 0.5-1mm, increasing gas-liquid contact area by 300%</p><p>- <strong>Modular design</strong>: Upper chamber (with cooling module) and lower chamber (reaction tank) connected by bolts, improving maintenance efficiency by 50%</p><h3>Industrial Practice and Benefit Analysis</h3><p>Various desulfurization technologies have achieved significant economic benefits in industrial applications.</p><strong>1. Pangang Rotary Magnesium Injection Desulfurization Technology</strong><p>Smelting desulfurization technology for special ore types:</p><p>- <strong>Rotary injection lance</strong>: Rotation speed 200rpm, increasing magnesium powder dispersion by 80%</p><p>- <strong>Directional slag conditioning technology</strong>: Adding CaO-Al₂O₃-SiO₂ flux, reducing slag phase viscosity from 3.5Pa·s to 1.2Pa·s</p><p>After implementing this technology, desulfurizing agent utilization rate increased to 85%, steel cost decreased by 40 yuan per ton, processing 4 million tons of hot metal annually and creating over 40 million yuan in benefits.</p><strong>2. Economic Comparison of Fine Particle Desulfurization</strong><p>Different desulfurization processes show significant economic differences:</p><p>- <strong>Reverse flotation</strong>: Medium investment cost, high operating cost (mainly reagent cost), suitable for -0.045mm fine particles</p><p>- <strong>Magnetic separation—flotation combined</strong>: High investment cost, medium operating cost, suitable for -0.074mm particle size</p><p>- <strong>Roasting—magnetic separation</strong>: Extremely high investment cost, low operating cost, suitable for all particle sizes</p><h3>Technology Development Trends</h3><p>Iron ore desulfurization technology is developing toward more precise, low-carbon directions.</p><p>- <strong>Mineral genomics research</strong>: Establishing pyrrhotite liberation models based on MLA (Mineral Liberation Analysis) to guide grinding fineness optimization and avoid over-grinding</p><p>- <strong>Biological desulfurization technology</strong>: Acidithiobacillus ferrooxidans achieving >80% desulfurization rate in 72 hours at pH=1.5 and 35°C</p><p>- <strong>Intelligent control systems</strong>: Combining online particle size analyzers with AI algorithms to dynamically adjust grinding-flotation parameters, reducing sulfur content fluctuation from ±0.15% to ±0.05%</p><p>Iron ore desulfurization should follow the principle of \"determining process by mineral characteristics and selecting equipment by particle size distribution\": staged grinding-separation still has cost advantages for coarse-grained sulfide minerals, while fine-grained pyrrhotite relies on the innovative coupling of activation flotation and efficient equipment. Future technological breakthroughs will focus on deep integration of low-cost liberation, selective adsorption, and low-carbon metallurgy, ultimately achieving directional migration and resource utilization of sulfur throughout the entire process.</p>"
  }