{
    "id": "mineral-dissemination-research-2025",
    "title": "Mineral Dissemination Size Analysis: Cornerstone of Mineral Processing Design and Efficiency Assurance",
    "slug": "mineral-dissemination-research",
    "date": "2025-06-10",
    "author": "Zexin Mining Technical Team",
    "category": "technical",
    "summary": "This paper systematically explains the core technical methods of mineral dissemination size analysis and highlights its decisive role in mineral processing flowsheet design, including crushing and grinding process formulation, separation method and equipment selection, process structure optimization, tailings resource utilization, and economic benefit assessment.",
    "image": "/images/news/mineral-dissemination.jpg",
    "content": "<p>Mineral dissemination characteristics profoundly determine mineral processing pathway selection, parameter optimization, and ultimate technical-economic indicators. This paper systematically explains the core technical methods of mineral dissemination size analysis and highlights its decisive role in mineral processing flowsheet design, including crushing and grinding process formulation, separation method and equipment selection, process structure optimization, tailings resource utilization, and economic benefit assessment. Through specific case analyses, it demonstrates the indispensability of dissemination size research as the scientific prerequisite for efficient, low-consumption, and stable operation of mineral processing production lines.</p><h3>Mineral Dissemination Size Analysis: Concept and Methods</h3><p>Mineral dissemination size refers to the natural particle size of valuable minerals in ore and their symbiotic relationships and spatial distribution characteristics with associated minerals. Its core parameters include:</p><p>- <strong>Target mineral particle size distribution</strong>: Size range and frequency distribution of valuable mineral particles</p><p>- <strong>Dissemination relationships</strong>: Contact boundary properties between valuable minerals and gangue minerals or other valuable minerals (encapsulation, adjacency, impregnation, etc.)</p><p>- <strong>Liberation characteristics</strong>: The ease and particle size limits of valuable mineral liberation under specific crushing conditions</p><strong>Core experimental techniques:</strong><p>- <strong>Optical microscopy analysis</strong>: Basic method for preliminary observation of mineral composition, dissemination relationships, and size range</p><p>- <strong>Scanning electron microscopy with energy dispersive spectroscopy</strong>: High-resolution observation of fine-grained dissemination, precise measurement of micro-region composition, analysis of complex intergrowths</p><p>- <strong>Mineral liberation analyzer</strong>: Automated quantitative analysis of liberation degree, intergrowth composition, and particle size distribution of large numbers of mineral particles</p><p>- <strong>X-ray micro-CT</strong>: Non-destructive three-dimensional reconstruction of mineral particles and their spatial distribution, revealing internal encapsulation relationships</p><h3>Core Importance of Dissemination Size Analysis</h3><strong>1. Determining the \"bull's eye\" of grinding process: target liberation size</strong><p>Core question: How fine must valuable minerals be crushed to achieve sufficient liberation?</p><p>Role of dissemination size analysis: Through detailed mineralogical research, precisely determine the critical particle size required for complete liberation of target minerals. This is the only scientific basis for determining the final grinding fineness.</p><p>Importance: Avoiding the blindness of \"under-grinding\" (insufficient liberation, low recovery) or \"over-grinding\" (dramatic increase in energy consumption, serious sliming, separation difficulties, metal loss). Over-grinding not only increases per-ton power consumption (accounting for over 50% of total concentrator energy consumption) but also deteriorates the flotation environment and significantly increases reagent consumption.</p><strong>2. Guiding crushing/grinding stages and process structure design</strong><p>Core question: How many crushing stages? How many grinding stages? Should staged grinding and separation be adopted, or centralized grinding?</p><p>Role of dissemination size analysis: Analyzing the liberation degree and enrichment of valuable minerals in different particle size ranges of the ore.</p><p>If high-grade easily liberated minerals or rich intergrowths exist in coarse fractions, staged grinding and separation processes are suitable, allowing early recovery of already liberated or enriched rough concentrate, reducing subsequent grinding volume, and lowering energy consumption and over-grinding risks (as in many porphyry copper ores and some gold ores).</p><p>If mineral dissemination is extremely fine and uniform, with basically no liberated particles or poor enrichment effects under coarse grinding, centralized grinding to the target fineness before separation may be more appropriate (as in some vanadium-titanium magnetite or rare metal ores with fine-grained dissemination).</p><strong>3. Providing direct basis for separation method and equipment selection</strong><p>Core question: Should gravity separation, magnetic separation, flotation, or combined processes be used? What types and specifications of separation equipment should be selected?</p><p>Role of dissemination size analysis:</p><p>- <strong>Particle size range</strong>: The effective separation particle size range of target minerals (e.g., gravity separation is effective for coarse and medium particles, flotation for fine and ultra-fine particles) determines the applicability of the main separation method</p><p>- <strong>Liberation characteristics and intergrowth properties</strong>: Influence the choice of separation method. For example: if valuable minerals have significant density differences from major gangue and coarse liberation size, gravity separation may be the efficient and low-consumption first choice (as in cassiterite and tungsten ores); if minerals have strong magnetic properties or significant magnetic differences, magnetic separation is an efficient method (as in magnetite); if mineral dissemination is complex, liberation size is fine, or multiple minerals need to be separated, flotation has advantages</p><p>- <strong>Equipment selection</strong>: The processing capacity, lower separation size limit, and adaptability to feed size of separation equipment must match the liberation size and separation requirements of target minerals</p><strong>4. Optimizing process structure to improve comprehensive resource utilization</strong><p>Core question: How to design reasonable rougher, cleaner, and scavenger cycles? How to process middlings? How to recover associated valuable elements?</p><p>Role of dissemination size analysis: Revealing behavioral differences of different particle sizes and intergrowth types during separation; helping determine the nature of middlings to decide on rational processing methods; identifying the occurrence state and dissemination size of associated valuable elements to provide key information for designing comprehensive recovery processes.</p><strong>5. Tailings property assessment and resource utilization/environmental design basis</strong><p>Core question: In what form are valuable metals lost in tailings? What is the potential utilization value of tailings? What are the stability and environmental risks of tailings storage facilities?</p><p>Role of dissemination size analysis: Analyzing the main causes of metal loss in tailings (unliberated loss, sliming loss, process/equipment efficiency loss) and providing information on mineral composition, particle size distribution, and occurrence state of tailings to assess their potential for use as construction materials or secondary resources, and to predict their physicochemical stability.</p><h3>Decisive Impact on Mineral Processing Production Line Design</h3><p>Dissemination size analysis results are the source input parameters and core decision basis for mineral processing production line design, permeating the entire design process:</p><p>- <strong>\"Lighthouse\" for process flow formulation</strong>: Directly determining whether to adopt \"more crushing, less grinding\", staged grinding-separation, or single grinding-separation; choosing main separation methods (gravity, magnetic, flotation) and their combinations</p><p>- <strong>\"Ruler\" for key equipment selection and specification determination</strong>: Selecting appropriate crushing equipment, grinding equipment, and separation equipment based on dissemination characteristics</p><p>- <strong>\"Benchmark\" for process parameter optimization</strong>: Initial process parameter settings in the design phase must closely focus on achieving effective liberation and efficient separation of target minerals</p><p>- <strong>\"Foundation\" for investment estimation and economic evaluation</strong>: The complexity of process flow, specifications and quantities of main equipment, plant size, and energy consumption levels directly affect project investment and operating costs</p><p>- <strong>\"Predictor\" of expected technical and economic indicators</strong>: Based on scientific judgment of mineral liberation difficulty and separation potential, predicting key technical and economic indicators of the designed production line</p><h3>Case Studies</h3><strong>1. A Large Porphyry Copper Mine</strong><p>Dissemination characteristics: Chalcopyrite dissemination size distribution is wide, with some coarse particles (>100μm) well liberated under relatively coarse grinding (e.g., P80=150μm); meanwhile, large amounts of fine and ultra-fine disseminated chalcopyrite are present.</p><p>Design application: Adopted \"staged grinding + staged separation\" process. After coarse grinding (P80≈150μm), coarse particle flotation recovers already liberated and rich intergrowth coarse copper minerals; rougher concentrate is reground to P80≈45μm for fine particle flotation.</p><p>Benefits: Significantly reduced total grinding energy consumption (approximately 20-30%), decreased over-grinding, and improved overall recovery.</p><strong>2. A Fine-Grained Gold Ore</strong><p>Dissemination characteristics: Gold mainly occurs as microscopic and submicroscopic particles encapsulated in pyrite, arsenopyrite, and other sulfides, or dispersed in quartz and other gangue minerals, with extremely fine native gold particle size (mostly <10μm).</p><p>Design application: Recognized that conventional grinding (P80=74μm) cannot achieve effective liberation. Designed ultra-fine grinding (P80<20μm or even <10μm) process, combined with efficient fine particle flotation or leaching (such as CIL) technology.</p><p>Benefits: Despite high grinding energy consumption, this is the only way to achieve effective gold recovery, avoiding significant metal losses due to insufficient liberation.</p><strong>3. A Complex Polymetallic Ore (Containing Copper, Lead, Zinc, Silver)</strong><p>Dissemination characteristics: MLA analysis showed copper minerals tightly intergrown with sphalerite and galena, with floatability differences between different minerals significantly affected by intergrowth states; silver mainly occurs in galena.</p><p>Design application: Based on detailed intergrowth analysis, designed a complex process of preferential flotation (partial bulk flotation) + concentrate regrinding and separation + separate middlings treatment, optimizing regrinding fineness and flotation reagent regimes for various circuits.</p><p>Benefits: Achieved comprehensive efficient recovery of multiple valuable metals, maximizing silver recovery rate.</p><h3>Conclusion</h3><p>Mineral dissemination size analysis is not simply a laboratory analysis but a fundamentally important, pioneering core research work in the field of mineral processing engineering. It profoundly reveals the \"natural code\" of ore processing:</p><p>- <strong>It is the only scientific scale for determining \"how fine to grind\"</strong>, directly avoiding energy waste and metal loss, laying the foundation for mineral processing efficiency</p><p>- <strong>It is the \"decision brain\" for process selection</strong>, dominating choices from crushing stages and grinding methods to main separation processes</p><p>- <strong>It is the \"design blueprint\" for equipment selection and parameters</strong>, ensuring that each equipment's capability precisely matches ore liberation requirements</p><p>- <strong>It is the \"exploration lamp\" for maximizing resource utilization</strong>, guiding associated element recovery and tailings resource utilization pathways</p><p>- <strong>It is the \"warning system\" for investment and risk</strong>, with accurate dissemination data being fundamental to estimating costs, benefits, and technical feasibility</p><p>Therefore, before designing a mineral processing production line, investing necessary resources in detailed and precise mineral dissemination size analysis research is the absolute prerequisite and indispensable key link to ensure that the designed process is technically advanced, economically reasonable, highly efficient, resource-efficient, and environmentally friendly. Mineral dissemination research is a solid bridge connecting geological resource endowments with efficient mineral processing engineering practice and the core support for mineral processing technology to progress from \"experience-based\" to \"precision-based\".</p>"
  }