{
  "id": "feldspar",
  "mineralName": "长石",
  "title": "长石选矿工艺",
  "processTitle": "长石选矿工艺流程",
  "processIntroduction": "根据长石矿矿石性质的不同，泽鑫可设计不同的长石选矿工艺方案，包括磁选、浮选或联合选矿工艺等，从而达到除去铁、石英、云母等杂质矿，获得含钾、钠的长石精矿，旨在获得高品位长石精矿。我们灵活的方法可定制用于钾长石、钠长石和霞石正长岩加工，确保每种特定矿石类型的最佳回收率和产品质量。",
  "processSteps": [
    {
      "title": "破碎筛分",
      "description": "根据不同的原矿大块粒度，泽鑫制定了不同的破碎流程，从简单的一段破碎流程到三段破碎流程，对块状矿石进行粗碎作业，之后进行筛分，破碎阶段合格矿石进入磨矿作业，筛上矿石则返回细碎，保证了进入下一段作业的矿石粒度的合格性。这一关键准备步骤确保只有适当粒度的物料进入后续操作，为最大化处理效率建立最佳粒度分布。"
    },
    {
      "title": "磨矿分级",
      "description": "破碎阶段的合格产品进入湿式格子球磨机进行磨矿，球磨机的排料进入分级设备进行分级，分级设备的沉砂返回球磨机再磨，分级设备的溢流即为磨矿阶段的合格产品。这种闭路磨矿操作确保精确的粒度控制，这对于后续加工阶段有效去除杂质至关重要，并最终决定了长石精矿的最终质量。"
    },
    {
      "title": "脱泥作业",
      "description": "将合格磨矿物料送入脱泥斗进行脱泥作业。此步骤有效去除细小粘土颗粒和其他可能干扰下游分离过程的泥浆。有效的脱泥显著提高后续磁选和浮选阶段的性能，去除可能污染最终产品或降低分离效率的颗粒。"
    },
    {
      "title": "分选提纯",
      "description": "经过脱泥后的矿石进入弱磁+强磁的两段磁选作业，去除矿石中的磁性物质。为了去除磁选精矿中可能存在的铁物质，钙物质和云母等杂质，分离矿石中过多的石英提高精矿品位，将对磁选精矿进行浮选除杂提纯。对于杂质矿物，泽鑫通常采用选择型良好的捕收剂获得高品位长石细粉，在保持优异回收率的同时实现卓越的产品纯度。"
    }
  ],
  "applicationsImage": "/images/products/mineral-processing-solutions/non-metallic/feldspar-beneficiation-process-flow.jpg",
  "applications": [
    {
      "title": "陶瓷工业用高品位长石",
      "description": "我们全面的选矿工艺生产铁含量极低的优质长石精矿，满足高品质陶瓷制造的严格要求。多阶段纯化方法有效去除含铁矿物、云母和其他会影响陶瓷产品白度和透明度的着色物质。我们优化的磨矿工艺确保一致的粒度分布，这对陶瓷配方中的受控熔融行为至关重要。"
    },
    {
      "title": "玻璃制造用纯化长石",
      "description": "泽鑫专业的磁选和浮选技术为玻璃工业生产铁含量极低的超纯长石精矿。我们的工艺有效去除会导致玻璃产品着色的含铁矿物。精心控制的选矿过程还保持各种玻璃配方所需的最佳氧化铝与碱金属比例，使我们的长石精矿非常适合容器和平板玻璃制造。"
    },
    {
      "title": "涂料和涂层用高品质填料",
      "description": "我们的长石选矿技术为涂料和涂层行业创造粒度分布受控的高白度超细长石粉。多阶段净化工艺去除影响最终产品亮度和性能特性的杂质。所得的高纯度长石填料在保持优异悬浮特性的同时，提供改善的耐久性、耐刮擦性和涂层配方中的消光特性。"
    },
    {
      "title": "先进应用的特种长石产品",
      "description": "通过精确的杂质控制和定制加工，我们为人造石、高性能陶瓷和特种玻璃配方等先进应用生产特种长石精矿。这些产品具有极低的铁和钛含量、精确的粒度分布和精心控制的化学成分。我们能够根据特定技术要求定制选矿工艺，生产标准等级无法提供所需性能的高价值长石产品。"
    }
  ],
  "relatedProducts": [
    "jaw-crusher",
    "vibratory-feeder",
    "cone-crusher",
    "inclined-vibrating-screen",
    "pneumatic-flotation-cell",
    "wet-overflow-ball-mill",
    "hydrocyclone-separator"
  ]
}